#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/vishnukap_learning/s3-website/runs/run-UD1Wmg75pdTGfst8

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:805586991204:certificate/88f06708-4f66-4a62-b348-b98d782cc35c]
aws_acm_certificate_validation.cert: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_s3_bucket.s3_static_website: Refreshing state... [id=www.visham.org]
aws_s3_bucket_policy.allow_access: Refreshing state... [id=www.visham.org]
aws_s3_bucket_ownership_controls.s3_static_website_object_ownership: Refreshing state... [id=www.visham.org]
aws_s3_bucket_public_access_block.s3_static_website_pa_block: Refreshing state... [id=www.visham.org]
aws_s3_object.files["logo192.png"]: Refreshing state... [id=logo192.png]
aws_s3_object.files["manifest.json"]: Refreshing state... [id=manifest.json]
aws_s3_object.files["logo512.png"]: Refreshing state... [id=logo512.png]
aws_s3_object.files["robots.txt"]: Refreshing state... [id=robots.txt]
aws_s3_object.files["asset-manifest.json"]: Refreshing state... [id=asset-manifest.json]
aws_s3_object.files["favicon.ico"]: Refreshing state... [id=favicon.ico]
aws_s3_object.files["index.html"]: Refreshing state... [id=index.html]
aws_s3_bucket_website_configuration.s3_static_website: Refreshing state... [id=www.visham.org]
aws_s3_bucket_acl.s3_static_website_acl: Refreshing state... [id=www.visham.org,public-read]
aws_cloudfront_distribution.cdn: Refreshing state... [id=E17YUM5QUJCVXF]
aws_route53_record.www: Refreshing state... [id=Z02024842F73WIP3EA0PB_www.visham.org_A]
aws_route53_record.dns: Refreshing state... [id=Z02024842F73WIP3EA0PB_visham.org_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_object.object["0"] will be created
  + resource "aws_s3_object" "object" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "89d76f95e100fc61f7271096ce86e7fc"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "css/main.073c9b0a.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "src/static/css/main.073c9b0a.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.object["1"] will be created
  + resource "aws_s3_object" "object" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "4284557f70f03d562b659f38b01eaa66"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "css/main.073c9b0a.css.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "src/static/css/main.073c9b0a.css.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.object["2"] will be created
  + resource "aws_s3_object" "object" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "06f18144a0fbe7ab678e4c63cd98974d"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/787.a3103ff7.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "src/static/js/787.a3103ff7.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.object["3"] will be created
  + resource "aws_s3_object" "object" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "33a0822877b384d97f5ab300ce5a6dfa"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/787.a3103ff7.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "src/static/js/787.a3103ff7.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.object["4"] will be created
  + resource "aws_s3_object" "object" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "8c5e43ddc9b4267fe3b25ca6bbaa018d"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/main.1af3e22d.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "src/static/js/main.1af3e22d.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.object["5"] will be created
  + resource "aws_s3_object" "object" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "b114cc85da504a772f040e3f40f8e46a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/main.1af3e22d.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "src/static/js/main.1af3e22d.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.object["6"] will be created
  + resource "aws_s3_object" "object" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "0f6c2e8181768b62f9000e181e2d9949"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/main.1af3e22d.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "src/static/js/main.1af3e22d.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.object["7"] will be created
  + resource "aws_s3_object" "object" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "06e733283fa43d1dd57738cfc409adbd"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "media/logo.6ce24c58023cc2f8fd88fe9d219db6c6.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "src/static/media/logo.6ce24c58023cc2f8fd88fe9d219db6c6.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @roguecomp, Action: `pull_request`*